/******************************************************************************
----------------本例程仅供学习使用，未经作者允许，不得用于其他用途。-----------
------------------------版权所有，仿冒必究！-----------------------------------
----------------1.开发环境:Arduino IDE-----------------------------------------
----------------2.测试使用开发板型号：Arduino UNO R3-------
----------------3.单片机使用晶振：16M------------------------------------------
----------------4.淘宝网址：Ilovemcu.taobao.com--------------------------------
----------------5.作者：神秘藏宝室---------------------------------------------
******************************************************************************/
#include <Arduino.h>

#define DO_PIN 2



void setup()
{
	pinMode(DO_PIN,OUTPUT);

	Serial.begin(9600);	//设置通讯的波特率为9600
	Serial.println("Welcome to use!");  //发送的内容
	Serial.println("Made by WAAAX!");  //发送的内容
}

void loop()
{
	digitalWrite(DO_PIN,HIGH);			
  delay(1000);
	digitalWrite(DO_PIN,LOW);		
	delay(1000);
}
